1s/ERP/Conf/Catalogs/Лико_ТипыСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_ТипыСообщений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Площадки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПлощадкаУдалить</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контакты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Площадка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_ТипыСообщений/Ext/ManagerModule.bsl
Функция ПолучитьПочтовыеАдреса(ТипСобощений,Знач Площадка) Экспорт //+Лико m.shenderov 14.05.2020
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(Площадка) = Тип("СправочникСсылка.Организации") Тогда 
		
		Площадка = Справочники.Лико_Площадки.ПлощадкаПоОрганизации(Площадка);
		
	КонецЕсли;
	
	Адресат="";
	//ТипСобощений=Справочники.Лико_ТипыСообщений.СоздатьЭлемент();
	Структура = Новый Структура;
	Структура.Вставить("Площадка",Площадка);
	НайденныеКонтакты= ТипСобощений.Площадки.НайтиСтроки(Структура);
	Адреса= Новый Массив;
	Для каждого Контакт Из НайденныеКонтакты  Цикл
		ОбщийМассив=СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Контакт.Контакты,";",Истина);
		Для каждого Адрес Из ОбщийМассив Цикл
			Если СтрНайти(Адрес,"@")>0 Тогда
				Адреса.Добавить(Адрес);
			КонецЕсли; 			
		КонецЦикла;		
	КонецЦикла;
	
	Для каждого Адрес Из Адреса Цикл
			 Адресат=Адресат + Адрес+";";
	КонецЦикла;
		
	Возврат ?(СтрДлина(Адресат)>0,Лев(Адресат,СтрДлина(Адресат)-1),Адресат);

		
КонецФункции //-Лико m.shenderov 14.05.2020
